DataProcessors/AM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>AM</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>flag_crosses</Name>
					<Comment>Нужны кроссы, замены детали</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>flag_weights</Name>
					<Comment>Нужны веса</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>flag_names</Name>
					<Comment>Нужны наименования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>flag_properties</Name>
					<Comment>Нужны свойства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>flag_images</Name>
					<Comment>Нужны изображения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>details</Name>
					<Comment>Детали по артикулу</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>detailid</Name>
							<Comment>Внутренний код детали</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>manufacturerid</Name>
							<Comment>Код производителя</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>manufacturer</Name>
							<Comment>Наименование производителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>oem</Name>
							<Comment>артикул без разделителей</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>formattedoem</Name>
							<Comment>форматированный артикул</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Comment>наименование позиции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>weight</Name>
							<Comment>вес в килограммах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Properties</Name>
					<Comment>Свойства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>detailid</Name>
							<Comment>Для детали с кодом</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>detailpropertyid</Name>
							<Comment>уникальный идентификатор свойства</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>property</Name>
							<Comment>наименование свойства</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>value</Name>
							<Comment>значение свойства</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>locale</Name>
							<Comment>язык свойства</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>rate</Name>
							<Comment>рейтинг</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Images</Name>
					<Comment>Изображения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>detailid</Name>
							<Comment>Для детали с кодом</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>filename</Name>
							<Comment>url картинки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>width</Name>
							<Comment>ширина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>height</Name>
							<Comment>высота</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>crosses</Name>
					<Comment>Замены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>detailid</Name>
							<Comment>Для детали с кодом</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>replacementid</Name>
							<Comment>Код пары деталей</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>replacementdetailid</Name>
							<Comment>Код детали заменителя</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>type</Name>
							<Comment>Replacement/Duplicate</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>way</Name>
							<Comment>Forward/Backward</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>rate</Name>
							<Comment>рейтинг</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>oem</Name>
							<Comment>артикул без разделителей</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>formattedoem</Name>
							<Comment>форматированный артикул</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>manufacturerid</Name>
							<Comment>Код производителя</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>manufacturer</Name>
							<Comment>Наименование производителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Comment>наименование позиции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>weight</Name>
							<Comment>вес в килограммах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/AM/Forms/ФормаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьИнформацию(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Артикул) Тогда
		Предупреждение("Не введен артикул для поиска!",5);
		Возврат;
	КонецЕсли;
    
	ЗаполнитьИнформациюНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если lxОбщий.ПроверкаЗапроленияЛогинаПароляLaximo() Тогда
		Предупреждение("Для работы с веб-сервисами необходимо указать логин и ключ доступа в карточке пользователя!");
		мПараметры = Новый Структура("Ключ", lxОбщий.ПолучитьСсылкуТекущегоПользователя());
		ОткрытьФормуМодально("Справочник.Пользователи.Форма.ФормаЭлементаУправляемая",мПараметры);
		
		Отказ = Истина;
	Иначе

	
	Объект.flag_crosses = Истина;
	Объект.flag_images = Истина;
	Объект.flag_properties = Истина;
	Объект.flag_names = Истина;
	Объект.flag_weights = Истина;

	Если ТипЗнч(ЭтаФорма.ВладелецФормы) <> Тип("Неопределено") Тогда
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.LaximoOEM.Форма.ДатаКартаHtmlУправляемая" Тогда
			Если Объект.Артикул <> ЭтаФорма.ВладелецФормы.Элементы.ДеталиУзла.ТекущиеДанные.OEM Тогда
				
				Объект.Артикул = ЭтаФорма.ВладелецФормы.Элементы.ДеталиУзла.ТекущиеДанные.OEM;
				Объект.Производитель = ЭтаФорма.ВладелецФормы.мПроизводитель;
				
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
 
	
	Если ЗначениеЗаполнено(Объект.Артикул) Тогда
		 ЗаполнитьИнформациюНаСервере();
		 Если Объект.details.Количество() > 0 Тогда
			 Элементы.details.ТекущаяСтрока = 0;
			 detailsПриАктивизацииСтроки(Элементы.details.ТекущаяСтрока);
		 КонецЕсли;
		 
	 КонецЕсли;	 
	 
	 Если ЗначениеЗаполнено(Объект.Производитель) Тогда
		 Элементы.Производитель.Видимость = Истина;
	 Иначе
		 Элементы.Производитель.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗаголовокНаСервере();
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовокНаСервере()
	 //ЭтаФорма.Заголовок = "Laximo АМ ("+Метаданные.Версия+")";
	 ЭтаФорма.Заголовок = "АМ поиск в интернете";
 КонецПроцедуры



&НаСервере
Процедура ЗаполнитьИнформациюНаСервере() 
	
	
	
	ОбъектОбработка = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.AM"));
	ОбъектОбработка.ЗаполнитьИнформацию();
	ЗначениеВДанныеФормы(ОбъектОбработка,Объект);	
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулПриИзменении(Элемент)
	Объект.Производитель = "";
	Если Не ЗначениеЗаполнено(Объект.Артикул) Тогда
		Объект.crosses.Очистить();
		Объект.Properties.Очистить();
		Объект.details.Очистить();
		Объект.Images.Очистить();
	Иначе
		ЗаполнитьИнформациюНаСервере();
		Если Объект.details.Количество() = 0 Тогда
			Предупреждение("По указанному артикулу ничего не найдено.",5);
		Иначе
			  Элементы.details.ТекущаяСтрока = 0;
			 detailsПриАктивизацииСтроки(Элементы.details.ТекущаяСтрока);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АртикулОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Артикул) Тогда
		Предупреждение("Не введен артикул для поиска!",5);
		Возврат;
	КонецЕсли;
	ЗаполнитьИнформациюНаСервере();
	Если Объект.details.Количество() = 0 Тогда
		Предупреждение("По указанному артикулу ничего не найдено.",5);
	Иначе
		//Предупреждение("Информация по артикулу заполнена.",2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура detailsПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.details.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		detailid = 0;
	Иначе
		detailid = ТекСтрока.detailid;
	КонецЕсли;
	
	
	Элементы.Crosses.ОтборСтрок = Новый ФиксированнаяСтруктура("detailid", detailid);
	Элементы.Properties.ОтборСтрок = Новый ФиксированнаяСтруктура("detailid", detailid);
	Элементы.Images.ОтборСтрок = Новый ФиксированнаяСтруктура("detailid", detailid);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ImagesВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Images.ТекущиеДанные;	
	
	мПараметры = Новый Структура("ИмяФайла", ТекСтрока.filename); 
	
	ОткрытьФорму("Обработка.AM.Форма.ФормаПросмотраИзображенияУправляемая", мПараметры);
	
	
КонецПроцедуры



&НаКлиенте
Процедура flag_ПриИзменении(Элемент)
	ИмяЭлемента = СтрЗаменить(Элемент.Имя,"flag_","");
	Попытка
		Объект[ИмяЭлемента].Очистить();
		Элементы["Группа"+ИмяЭлемента].Доступность = Объект["flag_"+ИмяЭлемента];
	Исключение КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	Если Объект.Артикул <> Источник.Элементы.ДеталиУзла.ТекущиеДанные.OEM Тогда
		ПриОткрытии(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) <> Тип("Неопределено") Тогда
		Если Объект.Артикул <> ЭтаФорма.ВладелецФормы.Элементы.ДеталиУзла.ТекущиеДанные.OEM Тогда
			ПриОткрытии(Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
